PC25/PC25-1000mm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1943957;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          750;
        startFace       1950357;
    }
    casing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          85370;
        startFace       1951107;
    }
)

// ************************************************************************* //
