PC25/PC25-1000mm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../BCDict"

application     cfdemSolverPiso;

startFrom       startTime;

stopAt          endTime;

writeControl    adjustableRunTime;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo 1;

//libs ( "libgroovyBC.so" "libfiniteVolumeCFDEM.so");

OptimizationSwitches { fileHandler collated; }

functions
{
#include "postProcessingDict"
}
// ************************************************************************* //
