PC25/PC25-1000mm/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
distributor
{
  type            explicitPorositySource;
  active          yes;
  explicitPorositySourceCoeffs
  {
    selectionMode   cellZone;
    cellZone        distributor;
    
    type            fixedCoeff;
    fixedCoeffCoeffs
    {
      alpha		(18.8e2	18.8e2 18.8e2); // 3.5 mm width, drop over 10 mm
      beta		( 3.5e2  3.5e2  3.5e2); // 
      coordinateSystem
      {
        type    cartesian;
        origin  (0 0 0);
        coordinateRotation
        {
          type    axesRotation;
          e1      (0 1 0);
          e2      (0 0 1);
        }
      }
    }
  
  }

}
*/

// ************************************************************************* //
